# Data Loading, Storage, and File Formats

## Reading and Writing Data in Text Format

 Table 6-1. Parsing functions in pandas
 Function            Description
 read_csv            Load delimited data from a file, URL, or file-like object; use comma as default delimiter
 read_table          Load delimited data from a file, URL, or file-like object; use tab ('\t') as default delimiter
 read_fwf            Read data in fixed-width column format (i.e., no delimiters)
 read_clipboard      Version of read_table that reads data from the clipboard; useful for converting tables from web pages
 read_excel          Read tabular data from an Excel XLS or XLSX file
 read_hdf            Read HDF5 files written by pandas
 read_html           Read all tables found in the given HTML document
 read_json           Read data from a JSON (JavaScript Object Notation) string representation
 read_msgpack        Read pandas data encoded using the MessagePack binary format
 read_pickle         Read an arbitrary object stored in Python pickle format
 read_sas            Read a SAS dataset stored in one of the SAS system’s custom storage formats
 read_sql            Read the results of a SQL query (using SQLAlchemy) as a pandas DataFrame
 read_stata          Read a dataset from Stata file format
 read_feather        Read the Feather binary file format

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
pd.read_csv('ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
names = ['a','b','c','d','message']

In [14]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [15]:
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
list(open('ex3.txt'))

['  A B C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [23]:
result= pd.read_table('ex3.txt',sep= '\s+')

In [24]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [27]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

    a   b   c   d message
0   1   2   3   4   hello
1   5   6   7   8   world
2   9  10  11  12     foo

In [28]:
result = pd.read_csv('ex5.csv')

In [29]:
result

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     foo

In [30]:
pd.isnull(result)

    something      a      b      c      d  message
0       False  False  False  False  False     True
1       False  False  False   True  False    False
2       False  False  False  False  False    False

In [34]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [35]:
result

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     foo

In [36]:
sentinels = {'message': ['foo','NA'],'something':['two']}

In [37]:
pd.read_csv('ex5.csv', na_values=sentinels)

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     NaN

Table 6-2. Some read_csv/read_table function arguments
 Argument            Description
 path                String indicating filesystem location, URL, or file-like object
 sep or delimiter    Character sequence or regular expression to use to split fields in each row
 header              Row number to use as column names; defaults to 0 (first row), but should be None if there is no
                      header row
 index_col           Column numbers or names to use as the row index in the result; can be a single name/number or a
                      list of them for a hierarchical index
 names               List of column names for result, combine with header=None
 skiprows            Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.
 na_values           Sequence of values to replace with NA
 comment             Character(s) to split comments off the end of lines.
 parse_dates         Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns.
                      Otherwise can specify a list of column numbers or name to parse. If element of list is tuple or list, will
                      combine multiple columns together and parse to date (e.g., if date/time split across two columns).
 keep_date_col       If joining columns to parse date, keep the joined columns; False by default.
 converters          Dict containing column number of name mapping to functions (e.g., {'foo': f} would apply the
                      function f to all values in the 'foo' column . 
 dayfirst            When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7,
                      2012); False by default.
 date_parser         Function to use to parse dates
 nrows               Number of rows to read from beginning of file.
 iterator            Return a TextParser object for reading file piecemeal.
 chunksize           For iteration, size of file chunks
 skip_footer         Number of lines to ignore at end of file.
 verbose             Print various parser output information, like the number of missing values placed in non-numeric
                      columns.
 encoding            Text encoding for Unicode (e.g., 'utf-8' for UTF-8 encoded text).
 squeeze             If the parsed data only contains one column, return a Series.
 thousands           Separator for thousands (e.g., ',' or '.').

## Reading Text Files in Pieces

In [38]:
pd.options.display.max_rows = 10

In [42]:
import pandas as pd
import numpy as np

# Set random seed for reproducibility
np.random.seed(42)

# Generate the data
data = []
for i in range(10000):
    row = [
        i,
        np.random.normal(0, 1),
        np.random.normal(0, 1),
        np.random.normal(0, 1),
        np.random.normal(0, 1),
        np.random.choice(list('ABCDEFGHIJKLMNOPQRSTUVWXYZ'))
    ]
    data.append(row)

# Create DataFrame
columns = ['', 'one', 'two', 'three', 'four', 'key']
df = pd.DataFrame(data, columns=columns)

# Save to CSV
df.to_csv('ex6.csv', index=False, float_format='%.6f')

print("File 'ex6.csv' created with 10000 rows!")

File 'ex6.csv' created with 10000 rows!

In [43]:
result = pd.read_csv('ex6.csv')

In [44]:
result

      Unnamed: 0       one       two     three      four key
0              0  0.496714 -0.138264  0.647689  1.523030   G
1              1 -0.916827 -0.124147 -2.010963 -0.492803   H
2              2 -0.580878 -0.525170 -0.571380 -0.924083   V
3              3 -2.439106  0.603441 -0.251044 -0.163867   S
4              4  0.142465 -0.034652  1.134339 -0.104746   G
...          ...       ...       ...       ...       ...  ..
9995        9995 -0.393108 -1.123158 -0.079028 -0.779463   U
9996        9996  0.265026 -1.227806  0.268761  1.344134   H
9997        9997 -0.203000 -0.407957 -0.709026  0.331596   J
9998        9998 -1.595832 -0.560294  0.451260  1.157619   J
9999        9999  1.152477 -1.143212 -0.536287 -0.804794   D

[10000 rows x 6 columns]

In [47]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [48]:
chunker

In [49]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

tot= pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [50]:
tot[:10]

key
V    426
U    416
O    413
R    411
M    411
S    410
Q    395
W    392
D    392
C    390
dtype: object